# Importing pandas

In [59]:
import pandas as pd

# Reading Data

In [60]:
data = pd.read_csv("PQ_Data.csv")

### Dispalying the first 5 columns

In [61]:
data.head()

,Date,Customer Age,Customer Gender,Country,State,Product Category,Sub Category,Quantity,Unit Cost,Unit Price
0,2/19/2016,29,F,United States,Washington,Accessories,Tires and Tubes,1,$80,$109
1,2/20/2016,29,F,United States,Washington,Clothing,Gloves,2,$25,$29
2,2/27/2016,29,F,United States,Washington,Accessories,Tires and Tubes,3,$4,$5
3,3/12/2016,29,F,United States,Washington,Accessories,Tires and Tubes,3,$88,$117
4,3/12/2016,29,F,United States,Washington,Accessories,Tires and Tubes,3,$35,$42

The column's names are clear and meaningful

### Checking the dtypes

In [62]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 34865 entries, 0 to 34864
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Date              34865 non-null  object
 1   Customer Age      34865 non-null  int64
 2   Customer Gender   34865 non-null  object
 3   Country           34865 non-null  object
 4   State             34865 non-null  object
 5   Product Category  34865 non-null  object
 6   Sub Category      34865 non-null  object
 7   Quantity          34865 non-null  int64
 8   Unit Cost         34865 non-null  object
 9   Unit Price        34865 non-null  object
dtypes: int64(2), object(8)
memory usage: 2.7+ MB

The datatypes of some columns needs to be changed from (object -> int) like in (Unit_Cost & Unit_Price)

# Data Cleaning

### Check there is no null

In [63]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 34865 entries, 0 to 34864
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Date              34865 non-null  object
 1   Customer Age      34865 non-null  int64
 2   Customer Gender   34865 non-null  object
 3   Country           34865 non-null  object
 4   State             34865 non-null  object
 5   Product Category  34865 non-null  object
 6   Sub Category      34865 non-null  object
 7   Quantity          34865 non-null  int64
 8   Unit Cost         34865 non-null  object
 9   Unit Price        34865 non-null  object
dtypes: int64(2), object(8)
memory usage: 2.7+ MB

there is no null all fields are field

### Changing the datatypes

In [64]:
data.Date = pd.to_datetime(data.Date)

#### Removing the str objects from the data to change the dtype

In [65]:
data["Unit Cost"] = data["Unit Cost"].str.replace("$","").str.replace(",","")

if we didn't write (.str) nothing is going to change because your "Unit Cost" column in data is a Pandas Series of strings (dtype: object), not a single string

In [66]:
data["Unit Price"] = data["Unit Price"].str.replace("$","").str.replace(",","")

#### Changing the dtype to int

In [67]:
data["Unit Cost"] = data["Unit Cost"].astype("int")

In [68]:
data["Unit Price"] = data["Unit Price"].astype("int")

#### Display the data after changes

In [69]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 34865 entries, 0 to 34864
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Date              34865 non-null  datetime64[ns]
 1   Customer Age      34865 non-null  int64
 2   Customer Gender   34865 non-null  object
 3   Country           34865 non-null  object
 4   State             34865 non-null  object
 5   Product Category  34865 non-null  object
 6   Sub Category      34865 non-null  object
 7   Quantity          34865 non-null  int64
 8   Unit Cost         34865 non-null  int64
 9   Unit Price        34865 non-null  int64
dtypes: datetime64[ns](1), int64(4), object(5)
memory usage: 2.7+ MB

### Checking for duplicated items

In [70]:
data.duplicated().sum()

np.int64(4)

there are 4 duplicated cells

#### Removing duplicated cells

In [71]:
data[data.duplicated() == True]

,Date,Customer Age,Customer Gender,Country,State,Product Category,Sub Category,Quantity,Unit Cost,Unit Price
18340,2016-04-16,18,M,France,Seine (Paris),Accessories,Tires and Tubes,2,12,18
28289,2015-08-08,30,F,United States,California,Accessories,Tires and Tubes,2,20,22
31095,2015-12-13,27,M,United States,California,Accessories,Bottles and Cages,3,18,19
33087,2015-08-31,33,F,Germany,Nordrhein-Westfalen,Accessories,Tires and Tubes,3,9,12

##### Storing the duplicated data for later

In [72]:
duplicated_data = data[data.duplicated() == True]

In [73]:
duplicated_data

,Date,Customer Age,Customer Gender,Country,State,Product Category,Sub Category,Quantity,Unit Cost,Unit Price
18340,2016-04-16,18,M,France,Seine (Paris),Accessories,Tires and Tubes,2,12,18
28289,2015-08-08,30,F,United States,California,Accessories,Tires and Tubes,2,20,22
31095,2015-12-13,27,M,United States,California,Accessories,Bottles and Cages,3,18,19
33087,2015-08-31,33,F,Germany,Nordrhein-Westfalen,Accessories,Tires and Tubes,3,9,12

In [74]:
data.drop_duplicates(inplace = True)

# Exploring Data

#### Displaying a summary

In [75]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 34861 entries, 0 to 34864
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Date              34861 non-null  datetime64[ns]
 1   Customer Age      34861 non-null  int64
 2   Customer Gender   34861 non-null  object
 3   Country           34861 non-null  object
 4   State             34861 non-null  object
 5   Product Category  34861 non-null  object
 6   Sub Category      34861 non-null  object
 7   Quantity          34861 non-null  int64
 8   Unit Cost         34861 non-null  int64
 9   Unit Price        34861 non-null  int64
dtypes: datetime64[ns](1), int64(4), object(5)
memory usage: 2.9+ MB

#### Calculating Statistics

In [76]:
data.describe()

,Date,Customer Age,Quantity,Unit Cost,Unit Price
count,34861,34861.000000,34861.000000,34861.000000,34861.000000
mean,2016-01-19 18:52:20.770488320,36.383781,2.002496,349.987321,389.368176
min,2015-01-01 00:00:00,17.000000,1.000000,1.000000,1.000000
25%,2015-10-26 00:00:00,28.000000,1.000000,45.000000,54.000000
50%,2016-01-28 00:00:00,35.000000,2.000000,150.000000,179.000000
75%,2016-04-26 00:00:00,44.000000,3.000000,455.000000,521.000000
max,2016-07-31 00:00:00,87.000000,3.000000,3240.000000,5082.000000
std,NaN,11.113025,0.813977,490.025390,525.326673

There are outliers in the Unit Cost and Unit Price columns

#### Reviewing the unique values

In [77]:
data["Product Category"].unique()

array(['Accessories', 'Clothing', 'Bikes'], dtype=object)

In [78]:
data["Sub Category"].unique()

array(['Tires and Tubes', 'Gloves', 'Helmets', 'Bike Stands',
       'Mountain Bikes', 'Hydration Packs', 'Jerseys', 'Fenders',
       'Cleaners', 'Socks', 'Caps', 'Touring Bikes', 'Bottles and Cages',
       'Vests', 'Road Bikes', 'Bike Racks', 'Shorts'], dtype=object)

#### Describing all columns

In [79]:
data.describe(include = "all")

,Date,Customer Age,Customer Gender,Country,State,Product Category,Sub Category,Quantity,Unit Cost,Unit Price
count,34861,34861.000000,34861,34861,34861,34861,34861,34861.000000,34861.000000,34861.000000
unique,NaN,NaN,2,4,45,3,17,NaN,NaN,NaN
top,NaN,NaN,M,United States,California,Accessories,Tires and Tubes,NaN,NaN,NaN
freq,NaN,NaN,17803,18074,10330,22529,11109,NaN,NaN,NaN
mean,2016-01-19 18:52:20.770488320,36.383781,NaN,NaN,NaN,NaN,NaN,2.002496,349.987321,389.368176
min,2015-01-01 00:00:00,17.000000,NaN,NaN,NaN,NaN,NaN,1.000000,1.000000,1.000000
25%,2015-10-26 00:00:00,28.000000,NaN,NaN,NaN,NaN,NaN,1.000000,45.000000,54.000000
50%,2016-01-28 00:00:00,35.000000,NaN,NaN,NaN,NaN,NaN,2.000000,150.000000,179.000000
75%,2016-04-26 00:00:00,44.000000,NaN,NaN,NaN,NaN,NaN,3.000000,455.000000,521.000000
max,2016-07-31 00:00:00,87.000000,NaN,NaN,NaN,NaN,NaN,3.000000,3240.000000,5082.000000
std,NaN,11.113025,NaN,NaN,NaN,NaN,NaN,0.813977,490.025390,525.326673

#### Most ferquent values

In [80]:
data.apply(lambda col: col.value_counts().idxmax())

Date                2016-03-01 00:00:00
Customer Age                         31
Customer Gender                       M
Country                   United States
State                        California
Product Category            Accessories
Sub Category            Tires and Tubes
Quantity                              2
Unit Cost                           180
Unit Price                           17
dtype: object

# Feature Extraction

#### Getting the Month and Year

In [81]:
data["Month"] = data.Date.dt.month_name()

In [82]:
data["Year"] = data.Date.dt.year

##### Displaying data after modifications

In [83]:
data.sample()

,Date,Customer Age,Customer Gender,Country,State,Product Category,Sub Category,Quantity,Unit Cost,Unit Price,Month,Year
29197,2016-06-24,52,F,United States,Oregon,Accessories,Tires and Tubes,1,780,926,June,2016

#### Adding (Total Revenue , Total Cost , Profit)

In [84]:
data["Total Revenue"] = data["Quantity"] * data["Unit Price"]

In [85]:
data["Total Cost"] = data["Quantity"] * data["Unit Cost"]

In [86]:
data["Profit"] = data["Total Revenue"] - data["Total Cost"]

##### Data after modifications

In [87]:
data.sample()

,Date,Customer Age,Customer Gender,Country,State,Product Category,Sub Category,Quantity,Unit Cost,Unit Price,Month,Year,Total Revenue,Total Cost,Profit
22164,2016-01-28,35,M,United States,California,Bikes,Road Bikes,1,1120,1202,January,2016,1202,1120,82

#### Adding Profit Categories

In [88]:
def Profit_Category (value):
    if(value > 0):
        return "Positive"
    elif(value < 0):
        return "Negative"
    else:
        return "Break Even"

Checking first

In [89]:
Profit_Category(100)

'Positive'

In [90]:
data["Profit Category"] = data.Profit.apply(Profit_Category)

In [91]:
data.sample()

,Date,Customer Age,Customer Gender,Country,State,Product Category,Sub Category,Quantity,Unit Cost,Unit Price,Month,Year,Total Revenue,Total Cost,Profit,Profit Category
34753,2016-03-10,23,M,United Kingdom,England,Accessories,Tires and Tubes,1,60,78,March,2016,78,60,18,Positive

# 🔹 Data Analysis Using the Following Questions

1️⃣ How many records (rows) are in the dataset?
   There are 34865

2️⃣ What is the total revenue (Total Revenue)?
   It's the total price of an order and it's equal (Total Revenue = Quantity * Unit Price)

3️⃣ What is the average selling price (Unit Price)?
    The average is equal 389.368176

4️⃣ Which sub-category (Sub Category) has the highest sales?
    It's (Tires and Tubes)

5️⃣ What is the highest profit achieved?
    using the following code its 1842

In [92]:
data.sort_values(by = "Profit" , ascending = False ).head(1)

,Date,Customer Age,Customer Gender,Country,State,Product Category,Sub Category,Quantity,Unit Cost,Unit Price,Month,Year,Total Revenue,Total Cost,Profit,Profit Category
7402,2016-07-12,50,M,Germany,Hessen,Accessories,Bike Racks,1,3240,5082,July,2016,5082,3240,1842,Positive

6️⃣ Which states generate the most revenu?
    using the following code its (Hessen)

In [93]:
data.sort_values(by = "Total Revenue" , ascending = False ).head(1)

,Date,Customer Age,Customer Gender,Country,State,Product Category,Sub Category,Quantity,Unit Cost,Unit Price,Month,Year,Total Revenue,Total Cost,Profit,Profit Category
7402,2016-07-12,50,M,Germany,Hessen,Accessories,Bike Racks,1,3240,5082,July,2016,5082,3240,1842,Positive

7️⃣ How many sales were made each year?

In [104]:
data.pivot_table(index = ["Year"] , values = ["Total Cost" , "Profit" , "Total Revenue"], aggfunc = "sum")

       Profit  Total Cost  Total Revenue
Year
2015   289367     9660704        9950071
2016  1974112    10426004       12400116

8️⃣ How many orders were placed for each product category (Product Category)?

In [102]:
data["Product Category"].value_counts()

Product Category
Accessories    22529
Bikes           7093
Clothing        5239
Name: count, dtype: int64

9️⃣ Which category generates the most profit during different months?

In [97]:
monthly_profit = (
    data.groupby(["Month", "Product Category"])["Profit"]
    .sum()
    .reset_index()
)

In [98]:
max_profit_per_month = monthly_profit.loc[
    monthly_profit.groupby("Month")["Profit"].idxmax()
]

In [99]:
print(max_profit_per_month)

        Month Product Category  Profit
0       April      Accessories  156726
3      August      Accessories   57745
6    December      Accessories   84684
9    February      Accessories  141903
12    January      Accessories  146515
15       July      Accessories   99863
18       June      Accessories  177029
21      March      Accessories  154989
24        May      Accessories  180792
27   November      Accessories   60102
30    October      Accessories   61247
33  September      Accessories   57718

🔟 Which months have the highest sales? Are there seasonal trends in sales?

In [100]:
monthly_sales = (
    data.groupby("Month")["Total Revenue"]
    .sum()
    .reset_index()
)

In [101]:
top_months = monthly_sales.sort_values("Total Revenue", ascending=False)
print(top_months.head())

      Month  Total Revenue
6      June        2682573
8       May        2626475
0     April        2200979
7     March        2135963
2  December        2116633